<a href="https://colab.research.google.com/github/JoyNeema/MTN-Data-Analysis/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Joy_Neema_DataReport_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##DATA ANALYSIS FOR MTN TELECOM COMPANY

## 1.0 Importing Libraries

In [ ]:
# Import libraries
#
import pandas as pd
import numpy as np

## 1.1 Loading Datasets

In [ ]:
#Loading of our datasets
#Loading dataset from excel file
#
url = '/content/CDR_description.xlsx'
df = pd.read_excel(url,sheet_name=0,header=1)
df.head()

           PRODUCT                                       Voice or SMS   String
0            VALUE                                      Billing price  Integer
1        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
2     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
3  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
4  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String

In [ ]:
#Loading the second excel file
#
url = '/content/cells_geo_description.xlsx'
df = pd.read_excel(url,sheet_name=0,header=1)
df.head()

         VILLES               City  String
0        STATUS  In Service or not  String
1  LOCALISATION  in ABIDJAN or not  String
2    DECOUPZONE  Geographical Zone  String
3      ZONENAME       Name of Zone  String
4     LONGITUDE          Longitude   Float

In [ ]:
#Load the csv Telecom_dataset
#
df1 = pd.read_csv('/content/Telcom_dataset.csv')
df1
df1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#Loading the Telecom_dataset2 csv
#
df2 = pd.read_csv('/content/Telcom_dataset2.csv')
df2
df2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
#Loading the telecom dataset 3
#
df3 = pd.read_csv('/content/Telcom_dataset3.csv')
df3
df3.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
#Loading the cells geo csv
#
df4 = pd.read_csv('/content/cells_geo.csv', delimiter=";")
df4
df4.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

## 1.2 Data Cleaning

##Rename Columns

In [ ]:
#Rename the columns in our cells 
# 
# previewing the column names
# change to lower case
df1.columns
  
df1.columns = map(str.lower, df1.columns)
df1.columns

columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_a_number_int',
'dw_b_number_int', 'country_a', 'country_b', 'cell_id', 'site_id']

In [ ]:
df4.columns

df4.columns = map(str.lower, df4.columns)
df4.columns

columns = ['unnamed: 0','city','status','localisation','decoupzone',	'zonename',	'longitude',	'latitude',	'region',	'area','cell_id', 'site_code']

In [ ]:
# changing columns titles for dataset 1
df1.columns=columns
df1.head()

  product  value              date_time  ... country_b     cell_id     site_id
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# changing columns titles for dataset 2

df2.columns = columns
df2.head()

  product  value              date_time  ... country_b     cell_id     site_id
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
# changing columns titles for dataset 3

df3.columns = columns
df3.head()

  product  value              date_time  ... country_b     cell_id     site_id
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
#changing dataset 4 columns
#

df4.columns = columns
df4.head()

   unnamed: 0     city      status  ... area     cell_id   site_code
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

##Concatenating the Three Datasets

In [ ]:
# combining the three datasets using concatenation

df_combine = pd.concat([df1,df2,df3], ignore_index = 1)
df_combine.tail()

      product  value              date_time  ... country_b     cell_id     site_id
14998   Voice      0  2012-05-09 00:01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
14999   Voice     62  2012-05-09 00:01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
15000   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50
15001   Voice     30  2012-05-09 00:01:43.0  ...     19e2e  98ed726da2  b4130b54ab
15002   Voice     60  2012-05-09 00:01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[5 rows x 10 columns]

##Dropping unnecessary columns

In [ ]:
# Dropping unnecessary columns 

df_combine_cleaned = df_combine.drop(columns = ['country_a' ,	'country_b' ,'cell_on_site'])
df_combine_cleaned.head()

  product  value  ...     cell_id     site_id
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  ...  051KhYDCpv  051KhYDCpv

[5 rows x 7 columns]

##Splitting the date and time column

In [ ]:
#Splitting the date and time column into separate columns

df_combine_cleaned.head()

# create a new column and split the date_time column into 2

df_combine_cleaned[['date', 'time']] = df_combine.date_time.str.split(expand=True)
df_combine_cleaned.head()

  product  value              date_time  ...     site_id        date        time
0   Voice      0  2012-05-06 23:04:37.0  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms      0  2012-05-06 23:05:25.0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms     25  2012-05-06 23:05:41.0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice     56  2012-05-06 23:05:42.0  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice     14  2012-05-06 23:06:29.0  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 9 columns]

##Check for Duplicates

In [ ]:
#Checking for duplicates
#
df_combine_cleaned.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
14998    False
14999    False
15000     True
15001    False
15002    False
Length: 15003, dtype: bool

In [ ]:
#Dropping all duplicates
#
df_combine_cleaned.drop_duplicates()

      product  value  ...     cell_id     site_id
0       Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1         sms      0  ...  /+cKZKIp41  /+cKZKIp41
2         sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3       Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4       Voice     14  ...  051KhYDCpv  051KhYDCpv
...       ...    ...  ...         ...         ...
14997   Voice     10  ...  6467daa1db  8a96bae9c1
14998   Voice      0  ...  2aa04dcab7  f7d63a29e5
14999   Voice     62  ...  7f1f2f889f  b4ddb9e93c
15001   Voice     30  ...  98ed726da2  b4130b54ab
15002   Voice     60  ...  1c11a2fcbb  6d70dae094

[14750 rows x 7 columns]

##Merging of Datasets

In [ ]:
#Creating a new list that containes our new cleaned datasets
#Merging the sets into one
#Dropping all rows that have null values
#Getting the count of each individual city
#Printing out our new merged sets
#
frames = [df4, df_combine_cleaned]
df_dataset = pd.concat(frames, axis=1)
x = df_dataset.dropna()
print(x)

      unnamed: 0      city      status  ...  dw_b_number_int     cell_id     site_id
23          23.0     ABOBO  In Service  ...  5a4dc9e82deb309  2yuhUrSXQu  2yuhUrSXQu
24          24.0     ABOBO  In Service  ...  55ad144fa74fddc  3mQAiRAfo7  3mQAiRAfo7
25          25.0     ABOBO  In Service  ...  5a4dc9e82deb309  2FzOAUm82C  2FzOAUm82C
26          26.0     ABOBO  In Service  ...  8f6917492bd38a0  +gySf02tKW  +gySf02tKW
27          27.0     ABOBO  In Service  ...  3f830c98519c5e9  /EkqCbWDau  /EkqCbWDau
...          ...       ...         ...  ...              ...         ...         ...
3969      3969.0  ZUENOULA  In Service  ...  ccf4057e804d9a3  07ed226112  334fdb9912
3970      3970.0  ZUENOULA  In Service  ...  b4ee2f72edeae15  729b6b4b22  9411ac7df8
3971      3971.0  ZUENOULA  In Service  ...  e5c8b355eb6b9ee  77255d2612  c6400e443f
3972      3972.0  ZUENOULA  In Service  ...  35b093b6a4549da  706d8914d0  22389546ec
3973      3973.0  ZUENOULA  In Service  ...  88dd51e4d6885f0  3424273a07  ae6cdb80c1

[3329 rows x 19 columns]

## 1.3 Data Analysis

##Most used City

In [ ]:
#Computing the most used city for the three days
#
df4['city'].max()

'ZUENOULA'

##Most used Products

In [ ]:
#Which was the most used product between voice and sms
#
df_combine_cleaned['product'].max()

'sms'

##Most used cities

In [ ]:
x = pd.value_counts(x['city'])
city_users = x.head()
x_max = x.max()
print(f"The city with the most users appears: {x_max} times\n")
print(f"The Most used cities in 3 days: \n CITY       COUNT\n{city_users}")

The city with the most users appears: 297 times

The Most used cities in 3 days:
 CITY       COUNT
COCODY         297
YOPOUGON       255
ABOBO          231
MARCORY        115
TREICHVILLE    113
Name: city, dtype: int64